Австралия/src/AccumulationRegisters/KitOrders/KitOrders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>KitOrders</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>KitOrder</name>
    <type>
      <types>DocumentRef.KitOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/KitOrders/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
		Or Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	KitOrders.LineNumber AS LineNumber,
	|	KitOrders.Company AS Company,
	|	KitOrders.KitOrder AS KitOrder,
	|	KitOrders.Products AS Products,
	|	KitOrders.Characteristic AS Characteristic,
	|	KitOrders.Quantity AS QuantityBeforeWrite,
	|	KitOrders.Quantity AS QuantityChange,
	|	KitOrders.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsKitOrdersChange
	|FROM
	|	AccumulationRegister.KitOrders AS KitOrders");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsKitOrdersChange", False);
	
EndProcedure

#EndRegion

#EndIf
